<p><strong>Hàng gh&ecirc;́ </strong></p>

<p>Ngày Noel đang đ&ecirc;́n g&acirc;̀n, chủ nhi&ecirc;̣m khoa Khoa Học Máy Tính mu&ocirc;́n&nbsp; nh&acirc;n dịp này t&ocirc;̉ chức cho sinh vi&ecirc;n toàn trường&nbsp;</p>

<p>m&ocirc;̣t bu&ocirc;̉i giao lưu, giải trí đ&ecirc;̉ sinh vi&ecirc;n được cải thi&ecirc;̣n tinh th&acirc;̀n học t&acirc;̣p sau nhi&ecirc;̀u&nbsp;ngày&nbsp;rèn luy&ecirc;̣n v&acirc;́t vả.</p>

<p>Ban chủ nhi&ecirc;̣m cũng mu&ocirc;́n giúp&nbsp;sinh vi&ecirc;n có m&ocirc;̣t tinh th&acirc;̀n thoải mái nh&acirc;́t trước khi bước vào kỳ thi cu&ocirc;́i kỳ sắp tới.</p>

<p>Bu&ocirc;̉i giao lưu được t&ocirc;̉ chức tại s&acirc;n v&acirc;̣n&nbsp; đ&ocirc;̣ng Th&ocirc;́ng Nh&acirc;́t.</p>

<p>Có <strong>n</strong> hàng gh&ecirc;́ trong s&acirc;n v&acirc;̣n đ&ocirc;̣ng.</p>

<p>Chúng ta được bi&ecirc;́t đang&nbsp;có <strong>a<sub>i</sub></strong> người đang ng&ocirc;̀i tr&ecirc;n hàng gh&ecirc;́ thứ <strong>i</strong>.</p>

<p>Có <strong>m</strong> người khác đang di chuy&ecirc;̉n đ&ecirc;́n s&acirc;n v&acirc;̣n đ&ocirc;̣ng và&nbsp;m&ocirc;̃i người trong s&ocirc;́ họ đ&ecirc;̀u có cho mình m&ocirc;̣t ch&ocirc;̃ ng&ocirc;̀i trong <strong>n</strong> hàng gh&ecirc;́.</p>

<p>Ban chủ nhi&ecirc;̣m mu&ocirc;́n tính số <strong>k</strong> là s&ocirc;́ người t&ocirc;́i đa tr&ecirc;n m&ocirc;̣t hàng&nbsp;gh&ecirc;́ sau khi đã th&ecirc;m <strong>m</strong> người tới s&acirc;n v&acirc;̣n đ&ocirc;̣ng. Giả sử c&aacute;c&nbsp;h&agrave;ng ghế n&agrave;y c&oacute; thể chứa v&ocirc; hạng người</p>

<p>&nbsp;</p>

<p>Y&ecirc;u cầu: T&iacute;nh số k nhỏ nhất v&agrave; số k lớn nhất c&oacute; thể. Để tiết kiệm dữ liệu việc sử dụng mảng hay c&aacute;c cấu tr&uacute;c dữ liệu tương tự&nbsp;sẽ bị ban</p>

<p>&nbsp;</p>

<p><strong>Input</strong></p>

<p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&nbsp; </strong>Dòng đ&acirc;̀u ti&ecirc;n chứa 2 s&ocirc;́ nguy&ecirc;n n (1 &le; n &le;10<sup>5</sup>) &ndash; là s&ocirc;́ hàng gh&ecirc;́ có trong s&acirc;n v&acirc;̣n đ&ocirc;̣ng,&nbsp;s&ocirc;́ nguy&ecirc;n m (1 &le; m &le; 10<sup>5</sup>) &ndash; là s&ocirc;́ người đang di chuy&ecirc;̉n đ&ecirc;́n c&ocirc;ng vi&ecirc;n.</p>

<p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - </strong>Dòng thứ hai chứa n s&ocirc;́ nguy&ecirc;n a<sub>i</sub>&nbsp;(1 &le;&nbsp;a<sub>i</sub>&nbsp;&le;10<sup>5</sup>) &ndash; là s&ocirc;́ người đang ng&ocirc;̀i tr&ecirc;n hàng gh&ecirc;́ thứ i.</p>

<p><strong>Output</strong></p>

<p><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; -&nbsp;</strong>In ra s&ocirc;́ k nhỏ nh&acirc;́t và s&ocirc;́ k lớn nh&acirc;́t có th&ecirc;̉, với k là s&ocirc;́ người t&ocirc;́i đa tr&ecirc;n m&ocirc;̣t hàng gh&ecirc;́ sau khi th&ecirc;m m người đ&ecirc;́n s&acirc;n v&acirc;n đ&ocirc;̣ng.</p>

<p><strong>Ví dụ</strong></p>

<table border="1" cellpadding="1" cellspacing="1" style="width:200px">
	<tbody>
		<tr>
			<td><strong>Input</strong></td>
		</tr>
		<tr>
			<td>
			<p>3 6</p>

			<p>1 6 5</p>
			</td>
		</tr>
		<tr>
			<td><strong>Output</strong></td>
		</tr>
		<tr>
			<td>
			<p>6&nbsp; 12</p>
			</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;Giải th&iacute;ch: Khi 6 người tới ngồi th&igrave; trong trường hợp &iacute;t nhất, d&atilde;y gh&eacute; sẽ c&oacute; số người l&agrave; 6 6 6. Trong trường hợp nhiều nhất th&igrave; l&agrave; 1 12 (6 người đều ngồi v&agrave;o đ&acirc;y)&nbsp;5</p>

<table border="1" cellpadding="1" cellspacing="1" style="width:200px">
	<tbody>
		<tr>
			<td><strong>Input</strong></td>
		</tr>
		<tr>
			<td>
			<p>3 7</p>

			<p>1 6 5</p>
			</td>
		</tr>
		<tr>
			<td><strong>Output</strong></td>
		</tr>
		<tr>
			<td>
			<p>7&nbsp; 13</p>
			</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;</p>

<table border="1" cellpadding="1" cellspacing="1" style="width:300px">
	<tbody>
		<tr>
			<td><strong>Input</strong></td>
		</tr>
		<tr>
			<td>
			<p>10 1000</p>

			<p>100 100 100 100 100 100 100 100</p>
			</td>
		</tr>
		<tr>
			<td><strong>Output</strong></td>
		</tr>
		<tr>
			<td>200&nbsp; 1100</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;</p>
