<p><strong>Nỗi&nbsp;đau của đ&ecirc;m Noel</strong></p>

<p><span style="font-size:1rem">Sắp đến Noel </span><span style="font-size:1rem">nhưng Hưng</span><span style="font-size:1rem">3508 phải chia tay bạn g&aacute;i&nbsp;v&agrave; kh&ocirc;ng c&oacute; ai trong v&ograve;ng tay để sưởi ấm những đ&ecirc;m gi&aacute; buốt</span><span style="font-size:1rem">. Hưng3508 rất buồn v&agrave; đau khổ</span><span style="font-size:1rem">. Nhưng rồi,</span><span style="font-size:1rem">&nbsp;anh quyết định code một b&agrave;i g&igrave; đ&oacute;</span><span style="font-size:1rem">. Hơn thế nữa, b&agrave;i đ&oacute; phải kh&oacute; để Hưng3508 ph&aacute;t triển bản th&acirc;n v&agrave; gi&uacute;p Việt Nam xứng đ&aacute;ng với c&aacute;c cường quốc năm ch&acirc;u. N&oacute;i vậy th&ocirc;i chứ thực ra để vơi&nbsp;đi phần n&agrave;o nỗi đau của việc bị gấu đ&aacute;. Hưng quyết định chọn b&agrave;i li&ecirc;n quan đến&nbsp;fibonacci v&igrave; n&oacute; gần gủi với anh&nbsp;nhất: &quot;Cho một số, kiểm tra số đ&oacute; c&oacute; phải l&agrave; số thuộc d&atilde;y Fibonacci bắt đầu 2 số 1 v&agrave; 1 hay kh&ocirc;ng&quot;. Thế nhưng, l&agrave;m vậy th&igrave; dễ qu&aacute;, Hưng3508&nbsp;l&agrave;m được ngay th&ocirc;i v&agrave; sẽ quay lại với nỗi đau tột c&ugrave;ng ấy. V&igrave; vậy,&nbsp;anh&nbsp;quyết định kh&ocirc;ng sử dụng c&aacute;c d&ograve;ng for v&agrave; while để l&agrave;m việc n&agrave;y nhằm mục đ&iacute;ch tăng độ kh&oacute; của game. Nhưng v&igrave; l&uacute;c học nhập m&ocirc;n lập tr&igrave;nh, Hưng3508 m&atilde;i chơi với gấu n&ecirc;n đ&atilde; kh&ocirc;ng học đệ qui kĩ. Khi l&agrave;m dạng n&agrave;y anh&nbsp;kh&ocirc;ng biết code sao v&agrave; việc nhớ lại đệ qui l&agrave;m anh nhớ tới cựu người ấy của m&igrave;nh v&agrave; anh sẽ lại đau khổ hơn nữa. Bạn h&atilde;y gi&uacute;p Hưng3508 code b&agrave;i n&agrave;y nh&eacute;.</span></p>

<p>- C&aacute;c từ bị ban (Kh&ocirc;ng được sử dụng trong code)<br />
<strong>define<br />
include<br />
class<br />
for<br />
while<br />
goto</strong></p>

<p>&nbsp;</p>

<p><strong>Input:</strong></p>

<p>Một d&ograve;ng duy nhất chứa một số nguy&ecirc;n dương n (2&nbsp;&lt;= n &lt;= 3*10<sup>19</sup>) l&agrave; số tầng l&aacute; của c&acirc;y th&ocirc;ng</p>

<p><strong>Output:</strong></p>

<p>D&ograve;ng đầu ti&ecirc;n ghi ra &ldquo;Yes&rdquo; nếu m l&agrave; số đ&oacute; l&agrave; số Fibonacci v&agrave; ghi ra thứ tự của số đ&oacute; trong d&atilde;y. Ghi ra &quot;No&quot; trong trường hợp ngược lại</p>

<p><strong>V&iacute; dụ mẫu:</strong></p>

<table border="1" cellpadding="1" cellspacing="1" style="width:500px">
	<tbody>
		<tr>
			<td><strong>Input</strong></td>
			<td><strong>Output</strong></td>
		</tr>
		<tr>
			<td>6</td>
			<td>No</td>
		</tr>
		<tr>
			<td>8</td>
			<td>Yes 6</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;&nbsp;</p>

<p><strong>Giải th&iacute;ch:</strong><br />
Với d&atilde;y Fibo: 1 1 2 3 5 8 th&igrave;:</p>

<p>- Số 8 l&agrave; số&nbsp;thứ&nbsp;6&nbsp;</p>

<p>- Số 6 kh&ocirc;ng c&oacute; trong d&atilde;y</p>
